// pages/gridNavPage/new/new.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    news: [{
        title: '学院志愿服务站学子积极参与爱心义卖志愿活动',
        img: 'http://www.gzmodern.cn/uploads/allimg/190401/42_190401164436_1.jpg',
        text: '为响应贯彻雷锋月精神，践行社会主义核心价值观，2019年3月31日，在信息工程学院党总支的统筹安排下，信息工程学院志愿服务站志愿者代表参加旭景社区协助车陂街家庭综合服务中心以“易物助困，爱心传递”公益ATM爱心市场为主题的义卖活动。'
      },
      {
        title: '学院党总支组织党员开展主题党日活动',
        img: 'http://www.gzmodern.cn/uploads/allimg/190401/42_190401164750_1.jpg',
        text: '为进一步推进信息工程学院党总支“学习型、服务型、创新型”党组织建设,2019年3月31日，信息工程学院党总支副书记许曾慧、党总支学生党支部书记韦樱花、学生党支部组织委员廖涓娟、学生党支部宣传、纪律委员陈海彬及全体在校学生党员一行前往广州市黄花岗公园参观纪念《告台湾同胞书》发表40周年图片展及进行主题为“缅怀先烈，致敬英雄”党日活动。'
      },
      {
        title: '信息工程学院获省职院校学生专业技能大赛二等奖',
        img: 'http://www.gzmodern.cn/uploads/allimg/190328/42_190328162427_1.jpg',
        text: '2019年3月23日上午，中山火炬职业学院举办“北侧教育杯”广东省职业院校学生专业技能大赛（HTML5交互融媒体内容设计与制作大赛），我校信息工程学院2017级专才WEB前端班学生谭上彪、林酉罡、张彬参加专业组比赛并获二等奖。信息软件与服务教研室吴明珠老师荣获优秀指导教师荣誉称号。'
      },
      {
        title: '我校荣获2018年度广州市创新创业（孵化）示范基地',
        img: 'http://www.gzmodern.cn/uploads/allimg/190311/42_190311154054_1.jpg',
        text: '日前，广州市人力资源与社会保障局正式发文，广州现代信息工程职业技术学院荣获2018年度广州市创新创业（孵化）示范基地，并获得政府对我校学生给予的创业补贴支持。据《广州市人力资源与社会保障局关于公布2018年度广州市创新创业（孵化）示范基地名单的通知》（穗人社函[2019]238号），我校是广州地区唯一一所获此殊荣的高校。'
      },
      {
        title: '我校师生参加广州户外运动节志愿者服务',
        img: 'http://www.gzmodern.cn/uploads/allimg/190402/42_190402170439_1.jpg',
        text: '2019年3月30日，第五届广州户外运动节暨“锦绣黄埔任我行”48公里徒步大会在科学广场举行开幕式，我校98名师生志愿者参与本次活动的服务工作。本次徒步活动共有3300人参与，在市民们的热情响应、志愿者们的协助下取得圆满成功，我校团委、学生会、青年志愿者协会的志愿服务也得到举办方和参赛选手们的一致好评。'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})